#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	/*int a = 2;
//	int b = 5;
//	int c = b / a;
//	int d = 1 / 2;
//	printf("%d\n", c);
//	printf("%d\n", d);*/
//
//	//float a = 5.0 / 2;
//	//float b = 5 / 2.0;
//	//float c = 5.0 / 2.0;
//	//double d = 1 / 2.0;
//	//printf("%f\n", a);
//	//printf("%f\n", b);
//	//printf("%f\n", c);
//	//printf("%lf\n", d);
//
//
//	//int a = 7 % 2;// 7/2 = 3......1
//	//printf("%d\n", a);
//
//	//非法操作
//	/*float a = 7 % 2.0;*/
//
//
//
//	//int a = 7;
//	////00000000000000000000000000000111 -> 7的原反补码
//	//int b = a << 1;
//	////将7的补码左移
//	////00000000000000000000000000001110 -> 14
//	//printf("%d\n", a);
//	//printf("%d\n", b);
//
//
//	//int a = -7;
//	////10000000000000000000000000000111 -> - 7的原码
//	////11111111111111111111111111111000 -> - 7的反码
//	////11111111111111111111111111111001 -> - 7的补码
//	//int b = a << 1;
//	////将-7的补码向左移动1位
//	////1111111111111111111111111110010->移动后的补码
//	////因为打印的是原码，所以需要将补码转换为原码
//	////1111111111111111111111111110001->补码 - 1得到反码
//	////1000000000000000000000000001110->反码符号位不变，其他位按位取反得到原码
//	//printf("%d\n", a); //-7
//	//printf("%d\n", b); //-14
//
//
//	//int a = 7;
//	////00000000000000000000000000000111 -> 7的原反补码
//	//int b = 7 >> 1;
//	////将7的补码向右移动移位，最左边补符号位0
//	////00000000000000000000000000000011 -> 3
//	//printf("%d\n", a);//7
//	//printf("%d\n", b);//3
//
//	//int a = -7;
//	////10000000000000000000000000000111 -> - 7的原码
//	////11111111111111111111111111111000 -> - 7的反码
//	////11111111111111111111111111111001 -> - 7的补码
//	//int b = a >> 1;
//	////将-7的补码向右移动1位，最左边补符号位
//	////11111111111111111111111111111100->移动后的补码
//	////打印的是原码
//	////11111111111111111111111111111011->补码 - 1求出反码
//	////10000000000000000000000000000100->符号位不变, 其他位按位取反求出原码
//	//printf("%d\n", a);//-7
//	//printf("%d\n", b);//-4
//
//
//	//int a = 3;
//	////00000000000000000000000000000011 -> 3的补码
//	//int b = -5;
//	////10000000000000000000000000000101 -> - 5的原码
//	////11111111111111111111111111111010 -> - 5的反码
//	////11111111111111111111111111111011 -> - 5的补码
//	//int c = a | b;
//	//// 3 | -5
//	////只要有1，就为1;同时为0，才为0
//	////1111111111111111111111111111011 -> 3 | -5 的补码
//	////因为符号为负，所以需要求原码
//	////1111111111111111111111111111010->补码 - 1得反码
//	////1000000000000000000000000000101->反码中符号位不变，其他位按位取反得原码
//	//printf("%d\n", c);//-5
//
//
//	//int a = 3;
//	////00000000000000000000000000000011 -> 3的补码
//	//int b = -5;
//	////10000000000000000000000000000101 -> - 5的原码
//	////11111111111111111111111111111010 -> - 5的反码
//	////11111111111111111111111111111011 -> - 5的补码
//	//int c = a & b;
//	//// 3 & -5 
//	////两个对应的二进制位同时为1才为1，否则为0
//	////00000000000000000000000000000011->a & b 的补码 / 原码
//	//printf("%d\n", c);//3
//	//return 0;
//
//	//int a = 3;
//	////00000000000000000000000000000011 -> 3的补码
//	//int b = -5;
//	////10000000000000000000000000000101 -> - 5的原码
//	////11111111111111111111111111111010 -> - 5的反码
//	////11111111111111111111111111111011 -> - 5的补码
//	//int c = a ^ b;
//	////3 ^ -5
//	////对应的二进制位相同为0，相异为1
//	////11111111111111111111111111111000 -> 3 ^ -5的补码
//	////因为负数的补码原码不同，需要求原码
//	////11111111111111111111111111110111->补码 - 1得反码
//	////10000000000000000000000000001000->反码中的符号位不变，其他位按位取反得原码
//	//printf("%d\n", c);//-8
//
//
//	//int a = 10;
//	//printf("%p\n", &a);//取出a的地址,地址用%p进行打印
//
//
//	//int a = 10;
//	//int n1 = sizeof(a);
//	//int n2 = sizeof(int);
//	//int n3 = sizeof a;
//	//printf("%u\n", n1);
//	//printf("%u\n", n2);
//	//printf("%u\n", n3);
//
//
//	//int n4 = sizeof int;//error
//	//
//
//
//	//int a = 0;
//	////~是按二进制按位取反
//	////00000000000000000000000000000000->a的补码
//	//int c = ~a;
//	////11111111111111111111111111111111 -> ~a的补码
//	////打印需要原码
//	////11111111111111111111111111111110->补码 - 1得到反码
//	////10000000000000000000000000000001->反码中符号位不变, 其他位按位取反得到原码
//	//printf("%d\n", c);//-1
//
//	
//
//
//
//
//	//int a = 13;
//	////00000000000000000000000000001101 -> 13的补码
//	////要求将13的第五位二进制位修改为1
//	////只需要在第五位的位置上或上一个1即可
//	//int b = 1 << 4;
//	////00000000000000000000000000001101 - a
//	////00000000000000000000000000010000 - b
//	//int c = a | b;//29
//	////a | b
//	////00000000000000000000000000011101 - c - 补码
//	////--------------------------------------------
//	////修改回原本的值
//	////只需要在第五位上与上一个0即可,但仍需保持原本其余位上的1不变,所以只有第五位为0，其余位都为1
//	////11111111111111111111111111101111 - d
//	//int d = ~b;
//	//int e = c & d; //13
//	//printf("%d\n", c);
//	//printf("%d\n", e);
//
//
//
//	//int a = 3;
//	//int b = ++a;//先++,后使用
//	////相当于:
//	////a += 1;
//	////b = a;
//	//printf("%d\n", a);//4
//	//printf("%d\n", b);//4
//	////---------------------------- -
//	//int c = 3;
//	//int d = c++;
//	////相当于:
//	////d = c;
//	////c += 1;
//	//printf("%d\n", c);//4
//	//printf("%d\n", d);//3
//
//	//int a = 3;
//	//int b = --a;
//	////相当于:
//	////a -= 1;
//	////b = a;
//	//printf("%d\n", a);//2
//	//printf("%d\n", b);//2
//	////---------------------- -
//	//int c = 3;
//	//int d = c--;
//	////相当于:
//	////d = c;
//	////c -= 1;
//	//printf("%d\n", c);//2
//	//printf("%d\n", d);//3;
//
//
//	int a = 10;
//	printf("%d\n", a--);//先使用 a = 10;再-- a -= 1;
//	printf("%d\n", a);// a = 9
//
//
//
//
//
//	return 0; 
//}


//void test(int a)
//{
//	printf("%d\n", a);
//}
//int main()
//{
//	int a = 10;
//	test(a--);
//	return 0;
//}

//int main()
//{
	/*int a = 10;
	int* pa = &a;
	*pa = 20;
	printf("%d\n", a);*/

	//int a = 3.14;//此代码可以运行,但会报警告----3.14是double类型
	//int b = (int)3.14;//可执行且不会报警告
	////将3.14转换为int类型,舍弃小数点后所有位
	//printf("%d\n", b);

	//if ("abc" == "abcdef")
	//{
	//	printf("hehe\n");
	//}

	//if (strcmp("abc", "abc") == 0)
	//{
	//	printf("hehe\n");
	//}

	//int a = 3;
	//int b = 5;
	//int c = a && b;
	////a,b都为真,则a&&b 则c为真(1)
	////若a,b中有一个为假，则c为假(0)
	//int d = 0;
	//int e = a && d;
	//printf("%d\n", c);
	//printf("%d\n", e);

	//int a = 3;
	//int b = 0;
	//int c = a || b;
	////只要a,b中有一个为真,则a || b则为真（1）
	////只有a,b都为假,则a || b 才为假（0）
	//int d = 0;
	//a = 0;
	//int e = a || d;
	//printf("c=%d\n", c);
	//printf("e=%d\n", e);

//}



//
//int main()
//{
//	//int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ || ++b || d++;
//	//printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//
//	int arr[10] = { 0 };
//	arr[7] = 8;//[]就是下标引用操作符
//	//arr[7] -> 实质: *(arr+7)
//	//*(arr+7) -> *(7+arr)
//	//*(7+arr) -> 7[arr]
//	printf("%d\n", arr[7]);
//	printf("%d\n", 7[arr]);
//
//
//
//	return 0;
//}


//struct Stu
//{
//	char name[20];
//	int age;
//	double score;
//};
//
//void set_stu(struct Stu ss)
//{
//	//字符串不能直接赋值
//	strcpy(ss.name, "zhangsan");//字符串拷贝
//	ss.age = 20;
//	ss.score = 100.0;
//}
//
//void print_stu(struct Stu ss)
//{
//	printf("%s %d %lf\n", ss.name, ss.age, ss.score);
//}
//
//int main()
//{
//	struct Stu s = { 0 };
//	set_stu(s);//错误示范
//	print_stu(s);
//	return 0;
//}


struct Stu
{
	char name[20];
	int age;
	double score;
};

void set_stu(struct Stu* ss)
{
	//字符串不能直接赋值
	strcpy(ss->name, "zhangsan");//字符串拷贝
	ss->age = 20;
	ss->score = 100.0;
};

void print_stu(struct Stu ss)
{
	printf("%s %d %lf\n", ss.name, ss.age, ss.score);
}

int main()
{
	struct Stu s = { 0 };
	set_stu(&s);//需要修改数据，则用址传递
	print_stu(s);
	return 0;
}

